---
title: "Convert A Variable To A Time Variable In pandas"
author: "Chris Albon"
date: 2017-12-20T11:53:49-07:00
description: "Convert A Variable To A Time Variable In Pandas."
type: technical_note
draft: false
---

In [17]:
# Import Preliminaries
import pandas as pd

In [18]:
# Create a dataset with the index being a set of names
raw_data = {'date': ['2014-06-01T01:21:38.004053', '2014-06-02T01:21:38.004053', '2014-06-03T01:21:38.004053'],
        'score': [25, 94, 57]}
df = pd.DataFrame(raw_data, columns = ['date', 'score'])
df

                         date  score
0  2014-06-01T01:21:38.004053     25
1  2014-06-02T01:21:38.004053     94
2  2014-06-03T01:21:38.004053     57

In [19]:
# Transpose the dataset, so that the index (in this case the names) are columns
df["date"] = pd.to_datetime(df["date"])
df

                        date  score
0 2014-06-01 01:21:38.004053     25
1 2014-06-02 01:21:38.004053     94
2 2014-06-03 01:21:38.004053     57

In [20]:
df.set_index("date")

                            score
date
2014-06-01 01:21:38.004053     25
2014-06-02 01:21:38.004053     94
2014-06-03 01:21:38.004053     57

In [21]:
df.set_index(df["date"])

                                                 date  score
date
2014-06-01 01:21:38.004053 2014-06-01 01:21:38.004053     25
2014-06-02 01:21:38.004053 2014-06-02 01:21:38.004053     94
2014-06-03 01:21:38.004053 2014-06-03 01:21:38.004053     57

In [22]:
df = df.set_index(df["date"])

In [23]:
df

                                                 date  score
date
2014-06-01 01:21:38.004053 2014-06-01 01:21:38.004053     25
2014-06-02 01:21:38.004053 2014-06-02 01:21:38.004053     94
2014-06-03 01:21:38.004053 2014-06-03 01:21:38.004053     57

In [25]:
df2 = pd.DataFrame({'year': [2015, 2016],
                       'month': [2, 3],
                       'day': [4, 5]})
df2

   year  month  day
0  2015      2    4
1  2016      3    5

In [27]:
pd.to_datetime(df2)

0   2015-02-04
1   2016-03-05
dtype: datetime64[ns]

In [28]:
 s = pd.Series(['3/11/2000', '3/12/2000', '3/13/2000']*1000)

In [29]:
s.head()

0    3/11/2000
1    3/12/2000
2    3/13/2000
3    3/11/2000
4    3/12/2000
dtype: object

In [32]:
%timeit k=pd.to_datetime(s,infer_datetime_format=True)

11.4 ms ± 619 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [35]:
k

NameError: name 'k' is not defined